content.org/posts/appscript-sheets.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-02-01 Sat 17:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>"Appscript - Sheets"</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="adam" />
</head>
<body>
<div id="content">
<h1 class="title">"Appscript - Sheets"</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgbc9a03c">1. Getting started</a></li>
<li><a href="#orgb980349">2. Resources</a></li>
<li><a href="#orga522167">3. Sample code</a></li>
<li><a href="#org4800c0e">4. Code walk through</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgbc9a03c" class="outline-2">
<h2 id="orgbc9a03c"><span class="section-number-2">1</span> Getting started</h2>
<div class="outline-text-2" id="text-1">
<p>
Appscript is pretty powerful and free, it is javascript with google api for
manipulating things.
</p>

<ol class="org-ol">
<li>Begin with a sheets document.</li>
<li>Open tools/script editor</li>
<li>Write in Code.gs</li>
<li>Rename to some &lt;project&gt;</li>
<li>Run with the triangle button</li>
<li>Ctrl + Enter to see the Log</li>
<li>Save it</li>
</ol>

<p>
Since most of the time I am operating on some selected range, you would
first select on some cells before running the script.
</p>
</div>
</div>

<div id="outline-container-orgb980349" class="outline-2">
<h2 id="orgb980349"><span class="section-number-2">2</span> Resources</h2>
<div class="outline-text-2" id="text-2">
<p>
Since most operations involve doing things with ranges, here is the
range api.
</p>

<p>
<a href="https://developers.google.com/apps-script/reference/spreadsheet/range">https://developers.google.com/apps-script/reference/spreadsheet/range</a>
</p>
</div>
</div>

<div id="outline-container-orga522167" class="outline-2">
<h2 id="orga522167"><span class="section-number-2">3</span> Sample code</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #4f97d7; font-weight: bold;">function</span> <span style="color: #bc6ec5; font-weight: bold;">myFunction</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>
  Logger.log<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"hello"</span><span style="color: #bc6ec5;">)</span>;
  <span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">activeSheet</span> = SpreadsheetApp.getActiveSheet<span style="color: #bc6ec5;">()</span>;
  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">var rangeList = activeSheet.getRangeList(['A1:B4', 'D1:E4']);</span>
  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">rangeList.activate();</span>

  <span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">selection</span> = activeSheet.getSelection<span style="color: #bc6ec5;">()</span>;
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Current Cell: D1</span>
  Logger.log<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">'Current Cell: '</span> + selection.getCurrentCell<span style="color: #2d9574;">()</span>.getA1Notation<span style="color: #2d9574;">()</span><span style="color: #bc6ec5;">)</span>;
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Active Range: D1:E4</span>
  Logger.log<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">'Active Range: '</span> + selection.getActiveRange<span style="color: #2d9574;">()</span>.getA1Notation<span style="color: #2d9574;">()</span><span style="color: #bc6ec5;">)</span>;
  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Active Ranges: A1:B4, D1:E4</span>
  <span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">ranges</span> =  selection.getActiveRangeList<span style="color: #bc6ec5;">()</span>.getRanges<span style="color: #bc6ec5;">()</span>;
  <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">i</span> = <span style="color: #a45bad;">0</span>; i &lt; ranges.length; i++<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
    Logger.log<span style="color: #2d9574;">(</span><span style="color: #2d9574;">'Active Ranges: '</span> + ranges<span style="color: #67b11d;">[</span>i<span style="color: #67b11d;">]</span>.getA1Notation<span style="color: #67b11d;">()</span><span style="color: #2d9574;">)</span>;
  <span style="color: #bc6ec5;">}</span>
  Logger.log<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">'Active Sheet: '</span> + selection.getActiveSheet<span style="color: #2d9574;">()</span>.getName<span style="color: #2d9574;">()</span><span style="color: #bc6ec5;">)</span>;

  <span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">ss</span> = SpreadsheetApp.getActiveSpreadsheet<span style="color: #bc6ec5;">()</span>
     source = ss.getActiveSheet<span style="color: #bc6ec5;">()</span>,
     sheetName = source.getName<span style="color: #bc6ec5;">()</span>,
     data = source.getDataRange<span style="color: #bc6ec5;">()</span>.getValues<span style="color: #bc6ec5;">()</span>;

  <span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">range</span> = source.getActiveRange<span style="color: #bc6ec5;">()</span>,
      startRow = range.getRowIndex<span style="color: #bc6ec5;">()</span>,
      startCol = range.getColumnIndex<span style="color: #bc6ec5;">()</span>,
      numRows = range.getNumRows<span style="color: #bc6ec5;">()</span>,
      numCols = range.getNumColumns<span style="color: #bc6ec5;">()</span>

  <span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">values</span> = range.getValues<span style="color: #bc6ec5;">()</span>

  <span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">sBG</span> = source.getDataRange<span style="color: #bc6ec5;">()</span>.getBackgrounds<span style="color: #bc6ec5;">()</span>;
  <span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">sFC</span> = source.getDataRange<span style="color: #bc6ec5;">()</span>.getFontColors<span style="color: #bc6ec5;">()</span>;
  <span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">sFF</span> = source.getDataRange<span style="color: #bc6ec5;">()</span>.getFontFamilies<span style="color: #bc6ec5;">()</span>;
  <span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">sFL</span> = source.getDataRange<span style="color: #bc6ec5;">()</span>.getFontLines<span style="color: #bc6ec5;">()</span>;
  <span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">sFFa</span> = source.getDataRange<span style="color: #bc6ec5;">()</span>.getFontFamilies<span style="color: #bc6ec5;">()</span>;
  <span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">sFSz</span> = source.getDataRange<span style="color: #bc6ec5;">()</span>.getFontSizes<span style="color: #bc6ec5;">()</span>;
  <span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">sFSt</span> = source.getDataRange<span style="color: #bc6ec5;">()</span>.getFontStyles<span style="color: #bc6ec5;">()</span>;
  <span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">sFW</span> = source.getDataRange<span style="color: #bc6ec5;">()</span>.getFontWeights<span style="color: #bc6ec5;">()</span>;
  <span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">sHA</span> = source.getDataRange<span style="color: #bc6ec5;">()</span>.getHorizontalAlignments<span style="color: #bc6ec5;">()</span>;
  <span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">sVA</span> = source.getDataRange<span style="color: #bc6ec5;">()</span>.getVerticalAlignments<span style="color: #bc6ec5;">()</span>;
  <span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">sNF</span> = source.getDataRange<span style="color: #bc6ec5;">()</span>.getNumberFormats<span style="color: #bc6ec5;">()</span>;
  <span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">sWR</span> = source.getDataRange<span style="color: #bc6ec5;">()</span>.getWraps<span style="color: #bc6ec5;">()</span>;

  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">var dest = source.getRange(startRow,3,numRows,numCols)</span>
  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">range.copyTo(dest)</span>

  <span style="color: #4f97d7; font-weight: bold;">for</span><span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">arow</span>=<span style="color: #a45bad;">0</span>;arow&lt;numRows;arow++<span style="color: #bc6ec5;">){</span>
    <span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">offCol</span> = startCol+numCols+<span style="color: #a45bad;">1</span>
    <span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">src</span> = source.getRange<span style="color: #2d9574;">(</span>startRow+arow,startCol,<span style="color: #a45bad;">1</span>,numCols<span style="color: #2d9574;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">dest</span> = source.getRange<span style="color: #2d9574;">(</span>startRow,offCol+numCols*arow,<span style="color: #a45bad;">1</span>,numCols<span style="color: #2d9574;">)</span>
    src.copyTo<span style="color: #2d9574;">(</span>dest<span style="color: #2d9574;">)</span>
  <span style="color: #bc6ec5;">}</span>

  source.getRange<span style="color: #bc6ec5;">(</span>startRow,startCol+numCols+<span style="color: #a45bad;">1</span>,<span style="color: #a45bad;">1</span>,numRows*numCols<span style="color: #bc6ec5;">)</span>.setHorizontalAlignment<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"left"</span><span style="color: #bc6ec5;">)</span>.activate<span style="color: #bc6ec5;">()</span>
  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">rangeList.activate();</span>
  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">dest.getRange(startRow,3,numRows,numCols).setValues(values)</span>
  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">.setBackgrounds(sBG)</span>
  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">.setFontColors(sFC)</span>
  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">.setFontFamilies(sFF)</span>
  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">.setFontLines(sFL)</span>
  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">.setFontFamilies(sFFa)</span>
  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">.setFontSizes(sFSz)</span>
  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">.setFontStyles(sFSt)</span>
  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">.setFontWeights(sFW)</span>
  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">.setHorizontalAlignments(sHA)</span>
  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">.setVerticalAlignments(sVA)</span>
  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">.setNumberFormats(sNF)</span>
  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">.setWraps(sWR)</span>

  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">sheet.deleteRows(startRow,numRows);</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org4800c0e" class="outline-2">
<h2 id="org4800c0e"><span class="section-number-2">4</span> Code walk through</h2>
<div class="outline-text-2" id="text-4">
<p>
The idea is to select a rectangular region and compress it into a single row.
The logic is very simple.  I don't delete the original region just so that it is
still something manual that I have to do.
</p>

<p>
The <code>range.copyTo</code> function is useful because it also copies the format.  I
leave the selection on the newly created row because it makes it easier to move
into its eventual destination.
</p>

<p>
The use case for this is the myriad of confirmation that I get while paying
bills I like to keep it all centrallized in a spreadsheet, but while copying and
pasting from some website, the format usually spans multiple rows and columns
and I would like to compress all the information into a single column.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-02-01T17:17:12-08:00</p>
<p class="author">Author: adam</p>
<p class="date">Created: 2020-02-01 Sat 17:57</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
